product = {'ดินสอกดpentel':{'ราคา':50, 'สี':'แดง'},
           'ยางลบ':{'ราคา':3, 'สี':'เขียว'},
           'ดินสอสี':{'ราคา':100, 'สี':'ส้ม'}}

while True: #คำสั่งให้วนลูปไปเรื่อยๆ จนกว่าจะกด ctr+c
    print('-------กรุณากรอกข้อมูล-------')
    p = input('ชื่อสินค้า: ')
    q = int(input('จำนวน: '))
    print('----------------------')
    if p in product:
        print(f'สินค้า: {p} \nราคา: {product[p]['ราคา']} บาท\nสี: {product[p]['สี']}')
        print(f'จำนวน: {q} ชิ้น\nราคาทั้งหมด:  {q * product[p]['ราคา']} บาท')
    else:
        print('ไม่มีสินค้าในระบบ')
    # ออกจากลูปโดยการกด ctr+c (ตอนที่รันแล้ว)
